app/Controllers/BillController.php

    public function fetchStudys()
    {
        $request = $this->request;
        $studyModel = new StudyModel();

        try {
            $start = (int) $request->getVar('start', FILTER_SANITIZE_NUMBER_INT);
            $length = (int) $request->getVar('length', FILTER_SANITIZE_NUMBER_INT);
            $search = esc($request->getVar('search')['value'] ?? '');
            $orderColumnIndex = (int) ($request->getVar('order')[0]['column'] ?? 0);
            $orderDir = ($request->getVar('order')[0]['dir'] ?? 'asc') === 'desc' ? 'desc' : 'asc';
            $termId = $this->request->getPost('term_id'); // รับค่า term_id

            // ถ้ามีการเลือก term_id
            $query = $studyModel->select('study.ID_Study, study.Firstname_S, study.Lastname_S, study.Total,
                course.Course_name, course.Price_DC, study.Status_Price, term_course.Term_name, study.HowToPay, study.balance,
                COUNT(*) as count_students, SUM(study.Total) as sumTotal, SUM(course.Price_DC) as sumPrice_DC')
                ->join('course', 'study.ID_Courses = course.id', 'left')
                ->join('term_course', 'study.ID_Terms = term_course.id', 'left');

            // ถ้ามีการกรองตาม term_id
            if ($termId) {
                $query->where('study.ID_Terms', $termId);
            }

            $query = $query->groupStart()
                ->like('study.Firstname_S', $search) // ค้นหาคำที่ตรงหรือมีคำค้นในชื่อ
                ->orLike('study.Lastname_S', $search) // ค้นหาคำที่ตรงหรือมีคำค้นในนามสกุล
                ->orLike('course.Price_DC', $search) // ค้นหาคำที่ตรงหรือมีคำค้นในยอดเงิน
                ->orLike('course.Course_name', $search) // ค้นหาคำที่ตรงหรือมีคำค้นในชื่อคอร์ส
                ->orLike('term_course.Term_name', $search) // ค้นหาคำที่ตรงหรือมีคำค้นในเทอม
                ->groupEnd()
                ->orderBy($this->getColumnName($orderColumnIndex), $orderDir)
                ->groupBy('study.ID_Terms, study.ID_Courses') // ใช้ groupBy เพื่อรวมยอดเงินตามเทอมและคอร์ส
                ->findAll($length, $start);

            $totalData = $studyModel->countAll();
---
SELECT `study`.`ID_Study`, `study`.`Firstname_S`, `study`.`Lastname_S`, `study`.`Total`, `course`.`Course_name`, `course`.`Price_DC`, `study`.`Status_Price`, `term_course`.`Term_name`, `study`.`HowToPay`, `study`.`balance`, COUNT(*) as count_students, SUM(study.Total) as sumTotal, SUM(course.Price_DC) as sumPrice_DC
FROM `study`
LEFT JOIN `course` ON `study`.`ID_Courses` = `course`.`id`
LEFT JOIN `term_course` ON `study`.`ID_Terms` = `term_course`.`id`
WHERE   (
`study`.`Firstname_S` LIKE '%%' ESCAPE '!'
OR  `study`.`Lastname_S` LIKE '%%' ESCAPE '!'
OR  `course`.`Price_DC` LIKE '%%' ESCAPE '!'
OR  `course`.`Course_name` LIKE '%%' ESCAPE '!'
OR  `term_course`.`Term_name` LIKE '%%' ESCAPE '!'
 )
GROUP BY `study`.`ID_Terms`, `study`.`ID_Courses`
ORDER BY `ID_Study` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows` FROM `study`