app/Controllers/Dashboard_term.php

    public function dashboard_term()
    {
        // Retrieve the session instance
        $session = session();

        // Get the user ID from the session
        $user_id = $session->get('id');

        // Redirect to login page if user is not logged in
        if (!$user_id) {
            return redirect()->to('/login');
        }

        // Create an instance of the DashboardModel to fetch terms
        $dashboardModel = new DashboardModel();

        // Create an instance of the CourseModel to fetch courses
        $courseModel = new CourseModel();

        // Fetch terms associated with the logged-in user
        // Fetching all terms from the system (not just the user's terms)
        $data['terms'] = $dashboardModel->findAll(); // ดึงข้อมูลเทอมทั้งหมดจากระบบ

        // Fetch courses associated with the logged-in user
        $data['courses'] = $courseModel->where('id_user', $user_id)->findAll();
---
SELECT *
FROM `course`
WHERE `id_user` = '24'