app/Controllers/EmployeeCr.php

SELECT *
FROM `users`
---
    public function fetchUsers()
    {
        $session = session();
        $userModel = new UserModel();
        $query = $userModel->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '22'
---
    public function updateUser()
    {
        // รับค่าข้อมูลจากฟอร์ม
        $userId = $this->request->getPost('user_id');
        $username = $this->request->getPost('username');
        $firstName = $this->request->getPost('first_name');
        $lastName = $this->request->getPost('last_name');
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('new_password');
        $confirmPassword = $this->request->getPost('confirm_new_password');
        $currentPassword = $this->request->getPost('current_password');
        $status = $this->request->getPost('status'); // รับข้อมูล status จากฟอร์ม

        // ดึงข้อมูลเดิมจากฐานข้อมูล
        $userModel = new \App\Models\UserModel();
        $existingUser = $userModel->find($userId);  // ค้นหาผู้ใช้จากฐานข้อมูล

UPDATE `users` SET `username` = 'manager', `first_name` = 'Test', `last_name` = 'Manager', `email` = 'manager@email.com', `status` = 'manager', `password` = '$2y$10$v4I5o7YN7Ij695/hbv1VfuJXgRslW3o2klF7Zx/HO/5KqlVwQLuD.', `updated_at` = '2025-03-26 12:30:36'
WHERE `users`.`id` IN ('22')
---
        }

        // อัปเดตข้อมูลในฐานข้อมูล
        $result = $userModel->update($userId, $data); // อัปเดตข้อมูลในฐานข้อมูล

SELECT *
FROM `users`
WHERE `users`.`id` = '22'
---
    public function getUserDetails($id)
    {
        $model = new UserModel();
        $user = $model->find($id);  // หาข้อมูลผู้ใช้จากฐานข้อมูลโดยใช้ ID