app/Controllers/StudentController.php

SELECT *
FROM `course`
WHERE `id_user` = '22'
SELECT *
FROM `study`
WHERE `ID_Terms` = '7'
---
    public function studentpage()
    {
        $session = session();
        $user_id = $session->get('id');

        if (!$user_id) {
            return redirect()->to('/login');
        }

        $dashboardModel = new DashboardModel();
        $courseModel = new CourseModel();
        $studyModel = new StudyModel(); // โมเดลที่ใช้ในการดึงข้อมูลนักเรียน

        // ดึงข้อมูลทั้งหมดของเทอม
        $terms = $dashboardModel->findAll();
        $courses = $courseModel->where('id_user', $user_id)->findAll();
        $isLoggedIn = $session->get('isLoggedIn') ?? false;

        // ตรวจสอบว่าแต่ละเทอมมีข้อมูลนักเรียนหรือไม่
        $validTerms = [];
        foreach ($terms as $term) {
            // ตรวจสอบว่ามีนักเรียนในเทอมนี้หรือไม่
            $studentsInTerm = $studyModel->where('ID_Terms', $term['id'])->findAll();

SELECT `study`.`ID_Study`, `course`.`Course_name`, `study`.`Firstname_S`, `study`.`Lastname_S`, `study`.`Phone_S`, `study`.`Firstname_P`, `study`.`Lastname_P`, `study`.`Phone_P`
FROM `study`
LEFT JOIN `course` ON `study`.`ID_Courses` = `course`.`id`
WHERE `study`.`ID_Terms` = '7'
ORDER BY `course`.`Course_name`
---
    public function printStudent()
    {
        $term_id = $this->request->getVar('term_id');  // รับค่า term_id จาก URL

        // ดึงข้อมูลนักเรียนที่ลงทะเบียนในเทอมที่เลือก และเรียงตามชื่อคอร์ส
        $studyModel = new StudyModel();  // ใช้ Model ชื่อ StudyModel
        $study = $studyModel->select('
                study.ID_Study,
                course.Course_name,
                study.Firstname_S,
                study.Lastname_S,
                study.Phone_S,
                study.Firstname_P,
                study.Lastname_P,
                study.Phone_P
            ')  // เลือกคอลัมน์ที่ต้องการ
            ->join('course', 'study.ID_Courses = course.id', 'left')  // เชื่อมกับตาราง course
            ->where('study.ID_Terms', $term_id)  // กรองตาม term_id
            ->orderBy('course.Course_name')  // เรียงตามชื่อคอร์ส
            ->findAll();

SELECT `study`.`ID_Study`, `term_course`.`Term_name`, `course`.`Course_name`, `course`.`Price_DC`, `course`.`open`, `course`.`id` as `Course_id`, COUNT(*) as count_students
FROM `study`
LEFT JOIN `course` ON `study`.`ID_Courses` = `course`.`id`
LEFT JOIN `term_course` ON `study`.`ID_Terms` = `term_course`.`id`
GROUP BY `term_course`.`Term_name`, `course`.`Course_name`, `course`.`Price_DC`, `course`.`open`
 LIMIT 10
---
    public function fetchStudys()
    {
        $request = $this->request;
        $studyModel = new StudyModel();

        try {
            // รับค่า term_id จากการเลือกใน JavaScript (เช่นจาก hidden input)
            $term_id = $request->getVar('term_id');
            $search = esc($request->getVar('search')['value'] ?? '');
            $start = (int) $request->getVar('start', FILTER_SANITIZE_NUMBER_INT);
            $length = (int) $request->getVar('length', FILTER_SANITIZE_NUMBER_INT);

            $query = $studyModel->select('study.ID_Study, term_course.Term_name, course.Course_name, course.Price_DC, course.open, course.id as Course_id, COUNT(*) as count_students')
                ->join('course', 'study.ID_Courses = course.id', 'left')
                ->join('term_course', 'study.ID_Terms = term_course.id', 'left')
                ->groupBy(['term_course.Term_name', 'course.Course_name', 'course.Price_DC', 'course.open']);

            // ตรวจสอบว่า term_id มีค่า ถ้ามีให้กรองตาม term_id
            if (!empty($term_id)) {
                $query->where('term_course.id', $term_id); // กรองข้อมูลตาม ID ของเทอม
            }

            // ตรวจสอบการค้นหาจากฟิลด์ search (ถ้ามี)
            if (!empty($search)) {
                $query->like('term_course.Term_name', $search); // ค้นหาจากชื่อเทอม
            }

            // ดึงข้อมูล
            $data = $query->limit($length, $start)->findAll();

SELECT COUNT(*) AS `numrows` FROM `study`
---
            // ปรับปรุงส่วนของการสร้างข้อมูลใน DataTable
            return $this->response->setJSON([
                "draw" => intval($request->getVar('draw')),
                "recordsTotal" => $studyModel->countAll(),

SELECT COUNT(*) AS `numrows` FROM `study`
---
    public function getStudyCount()
    {
        $studyModel = new StudyModel();
        // ค้นหาจำนวน ID_Study ทั้งหมดในฐานข้อมูล
        $studyCount = $studyModel->countAll(); // ใช้ $studyModel แทน $this->$studyModel

SELECT `term_course`.`Term_name`, `course`.`Course_name`
FROM `study`
LEFT JOIN `course` ON `study`.`ID_Courses` = `course`.`id`
LEFT JOIN `term_course` ON `study`.`ID_Terms` = `term_course`.`id`
WHERE `study`.`ID_Study` IN ('19')
 LIMIT 1
SELECT `study`.`ID_Study`, `study`.`Firstname_S`, `study`.`Lastname_S`, `study`.`Phone_S`, `study`.`Firstname_P`, `study`.`Lastname_P`, `study`.`Phone_P`, `course`.`Course_name`, `term_course`.`Term_name`
FROM `study`
LEFT JOIN `course` ON `study`.`ID_Courses` = `course`.`id`
LEFT JOIN `term_course` ON `study`.`ID_Terms` = `term_course`.`id`
WHERE `term_course`.`Term_name` = 'ซัมเมอร์ เมษายน 2567   เทอม 1/2567'
AND `course`.`Course_name` = 'คอร์สเรียน ป.1'
---
    public function generateNames()
    {
        $ids = $this->request->getGet('ids');

        // ถ้าไม่ได้ส่งค่า IDs มา
        if (!$ids) {
            return "กรุณาเลือกนักเรียนก่อนพิมพ์รายชื่อ!";
        }

        // แปลงค่า IDs เป็น array
        $idsArray = explode(',', $ids);

        // ดึงข้อมูลของนักเรียนที่ถูกเลือก
        $studyModel = new StudyModel();
        $selectedStudent = $studyModel->select('term_course.Term_name, course.Course_name')
            ->join('course', 'study.ID_Courses = course.id', 'left')
            ->join('term_course', 'study.ID_Terms = term_course.id', 'left')
            ->whereIn('study.ID_Study', $idsArray)
            ->first();

        // ถ้าไม่พบข้อมูล
        if (!$selectedStudent) {
            return "ไม่พบข้อมูลนักเรียนที่เลือก!";
        }

        // ดึงรายชื่อนักเรียนทั้งหมดที่อยู่ในเทอมและคอร์สเดียวกัน
        $studentsData = $studyModel->select('study.ID_Study, study.Firstname_S, study.Lastname_S, study.Phone_S,
                                            study.Firstname_P, study.Lastname_P, study.Phone_P,
                                            course.Course_name, term_course.Term_name')
            ->join('course', 'study.ID_Courses = course.id', 'left')
            ->join('term_course', 'study.ID_Terms = term_course.id', 'left')
            ->where('term_course.Term_name', $selectedStudent['Term_name'])
            ->where('course.Course_name', $selectedStudent['Course_name'])
            ->findAll();