app/Controllers/Studypage.php

SELECT *
FROM `course`
WHERE `id_user` = '24'
---
    public function studypage()
    {
        $session = session();
        $user_id = $session->get('id');

        if (!$user_id) {
            return redirect()->to('/login');
        }

        $dashboardModel = new DashboardModel();
        $courseModel = new CourseModel();

        $data['terms'] = $dashboardModel->findAll();
        $data['courses'] = $courseModel->where('id_user', $user_id)->findAll();

SELECT *
FROM `term_course`
WHERE `term_course`.`id` = '9'
SELECT *
FROM `course`
WHERE `id_term` = '9'
---
    public function getCourses()
    {
        $termId = $this->request->getPost('termId');
        $courseModel = new CourseModel();

        // Validate termId
        $term = $courseModel->find($termId);
        if (!$term) {
            return $this->response->setJSON(['success' => false, 'message' => 'ไม่พบข้อมูลเทอม']);
        }

        // Fetch courses for the selected term
        $courses = $courseModel->where('id_term', $termId)->findAll();