app/Controllers/UsersController.php

SELECT *
FROM `member`
---
    public function fetchUsers()
    {
        $memberModel = new MemberModel();
        $query = $memberModel->findAll();