app/Models/CourseModel.php

UPDATE `course` SET `open` = '1', `updated_at` = '2025-03-30 20:16:06'
WHERE `course`.`id` IN (2)
---
    public function updateCourse(int $id, array $data): bool
    {
        return $this->update($id, $data);