app/Models/StudyModel.php

SELECT COUNT(*) AS `numrows`
FROM `study`
WHERE `ID_Terms` = '8'
---
    public function getStudentCountByTerm($termId)
    {
        $count = $this->where('ID_Terms', $termId)->countAllResults();